Revit 2026 API

# RebarConstraintReplaceReferenceTargets Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ReplaceReferenceTargets(
	RebarConstrainedHandle handle,
	IList<Reference> targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
```
```vb
Public Sub ReplaceReferenceTargets (
	handle As RebarConstrainedHandle,
	targetReferences As IList(Of Reference),
	isConstraintToCover As Boolean,
	offsetValue As Double
)
```
```cpp
public:
void ReplaceReferenceTargets(
	RebarConstrainedHandle^ handle,
	IList<Reference^>^ targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
```
```fsharp
member ReplaceReferenceTargets :
        handle : RebarConstrainedHandle *
        targetReferences : IList<Reference> *
        isConstraintToCover : bool *
        offsetValue : float -> unit
```

#### Parameters

handle RebarConstrainedHandle

targetReferences IListReference

isConstraintToCover Boolean

offsetValue Double

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace